#语言:Selected=1(中文chinese);Selected=2(英文english)
[Language]
Kinds=2
Selected=1
LangPath=Language\

Lang1File=Chinese.ini
Lang1FontName=
Lang1FontSize=

Lang2File=English.ini
Lang2FontName=
Lang2FontSize=

[System]
#Msc设备VendorID和ProductID,值十六进制表示,例:MSC_VID=0x0BB4,MSC_PID=0x0C01
MSC_VID=0x0bb4
MSC_PID=0x0c02

#用户盘操作的相关设置
#用户盘卷标,在拷贝Demo过程中会对用户盘做格式化,可以通过此项指定卷标
DISKVOLUME=USER_DISK
#Demo路径可以是目录或者文件,拷贝到用户盘根目录
DEMOPATH=C:\Users\lzw\Desktop\OemImage.img
#拷贝Demo后是否重启设备,当RESET_COPYDEMO=TRUE时,拷贝Demo结束后重启设备,默认不重启
RESET_COPYDEMO=

#指定是否支持全速usb设备,当SUPPORTLOWUSB=TRUE时,增加全速usb设备支持,默认只支持高速usb设备
SUPPORTLOWUSB=

#当NOTRESET_AFTER_UPGRADE=TRUE时,升级结束不进行自动重启
NOTRESET_AFTER_UPGRADE=

#设置DEFAULT_FIRMWARE项，可以在程序启动时自动打开默认的固件
DEFAULT_FIRMWARE=

UID_STRING=ROCKCHIP

#固件版本显示制式,DEC为十进制显示,默认为十六进制显示
FW_VERSION_MODE=

#Android固件,可以通过指定MISC_MODIFY_MODE为WIPE_DATA和WIPE_ALL来修改misc分区数据，#WIPE_DATA时不擦除用户空间数据,WIPE_ALL则全部擦除
MISC_MODIFY_MODE=

MSC_TIMEOUT=30
ROCKUSB_TIMEOUT=30

#当设置FW_NOT_CHECK=TRUE时,固件加载时不进行完整性校验
FW_NOT_CHECK=

#当设置FW_CHCEK_EFUSE=TRUE时,固件烧写时会校验efuse是否烧写。注意：该选项和FW_BURN_EFUSE=TRUE 互斥，二者只能选择一个。
FW_CHCEK_EFUSE=

#当设置FW_BURN_EFUSE=TRUE时,固件烧写时会去烧写efuse。注意：该选项和FW_CHCEK_EFUSE=TRUE互斥，二者只能选择一个。
FW_BURN_EFUSE=

#当设置MSC_UPGRADE_SUPPORT＝TRUE时，支持msc模式下进行升级，默认是关闭此功能
MSC_UPGRADE_SUPPORT=
#设置烧写固件时单次传输的数据带宽，取值在[0-6]之间，6代表1M,5代表512K，0代表16K
FORCE_DATA_BAND=2
#当设置LOOP_TEST=TRUE时,主要为了解决在循环测试过程中，没有检测到设备掉线的情况，导致无法循环测试
LOOP_TEST=
#单位秒，取值范围(0,60]
RESTART_TIMEOUT=
#切换重试时间间隔,单位秒,取值范围(0,60]
SWITCH_RETRY_INTERVAL=
#当设置SN_DLL_ON=TRUE时，开启升级过程写SN功能，SN数据通过sn.dat获取
SN_DLL_ON=

#设置MEMORY_CHECK_INTERVAL为对应的值，可以在烧写镜像文件时开启快速校验。即在每个设置的内存间隔内，取64K数据校验。
#以下数字为可选项  0，1，2，3，4，5  如果设置为其它数，将默认执行完全校验
#对应选项的内存距离 0=完全校验 1=每128K校验64K 2=每256K校验64K 3=每1M校验64K 4=每2M校验64K 5=每4M校验64K
#例如  MEMORY_CHECK_INTERVAL=3  则每1M校验64K数据
#不进行完全校验的话，数值设置越大，校验的数据越少。速度提升同时风险也对应增加，请知悉。
MEMORY_CHECK_INTERVAL=1
#是否从非sparse固件升级到sparse固件，true时为非sparse到sparse
SPARSE=
